Catalogs/НастройкиСинхронизацииСБитрикс24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиСинхронизацииСБитрикс24</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоДнейХраненияИстории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрезатьИсториюОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСинхронизацииДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияКонтрагентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЛогированиеОбменаСБитрикс24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЛогированиеОбменаСБитрикс24</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщенийОбменаСБитрикс24</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаСинхронизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиСинхронизацииСБитрикс24</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиСинхронизацииСБитрикс24/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		
		НастройкаПодключения = Параметры.Ключ;
		
		Токен = ОбменСБитрикс24ВызовСервера.ПолучитьТокен(НастройкаПодключения);
		
		УстановитьПривилегированныйРежим(Истина); //Для возможности всем пользователям читать расписание		
		
		НайденноеРегламентноеЗадание = Неопределено;
		Если ЗначениеЗаполнено(Объект.ИдентификаторРегламентногоЗадания) Тогда
			НайденноеРегламентноеЗадание = РегламентныеЗаданияСервер.Задание(Объект.ИдентификаторРегламентногоЗадания);
		КонецЕсли;
	
		Если НайденноеРегламентноеЗадание = Неопределено Тогда
			РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		Иначе
			РасписаниеРегламентногоЗадания = НайденноеРегламентноеЗадание.Расписание;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		
		УстановкаБазовыхНастроекПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементовФормы();
	УстановитьНадписьРасписанияОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И НЕ НужноЗакрытьОкно Тогда
		Отказ = Истина; 
		
		Если ЗавершениеРаботы Тогда 
			ТекстПредупреждения = "Настройки не будут сохранены. Закрыть?"; 
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗакрытииОкна", ЭтаФорма, Параметры);
			ПоказатьВопрос(Оповещение, "Настройки были изменены. Сохранить изменения перед закрытием?", РежимДиалогаВопрос.ДаНетОтмена, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗакрытииОкна(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		НужноЗакрытьОкно = Истина;
		
		СохранитьНастройки();
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		НужноЗакрытьОкно = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменСБитрикс24ВызовСервера.ЗаписатьНовыйТокен(ТекущийОбъект, Токен);
			
КонецПроцедуры

&НаКлиенте
Процедура ТокенНаФормеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	//Если НЕ СохранитьНастройки() Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Возврат;
	//КонецЕсли;
	//
	//ОбменСБитрикс24ВызовСервера.ЗаписатьНовыйТокен(Объект.Ссылка, Текст);
	//Токен = ОбменСБитрикс24ВызовСервера.ПолучитьТокен(Объект.Ссылка);
	
	ОбщиеНастройки = Новый  Структура;
	ОбщиеНастройки.Вставить("НастройкаПодключения"	, Неопределено);
	ОбщиеНастройки.Вставить("Портал"				, "");
	ОбщиеНастройки.Вставить("ТипыСообщений"			, ОбменСБитрикс24ВызовСервера.ПолучитьТипыСообщений());
	
	ОбменСБитрикс24КлиентСервер.ДобавлениеНастроекПодключения(ОбщиеНастройки);
	
	ОбменСБитрикс24ВызовСервера.ПолучитьТокенДляСоединения(ОбщиеНастройки, Ложь, Текст);
	
	РезультатРазбора = ОбменСБитрикс24КлиентСервер.РазобратьАдресСайта(ОбщиеНастройки.НастройкиПодключения.АдресСайта, ОбщиеНастройки);
	
	Если РезультатРазбора = Истина Тогда
	//	
	//	УжеЕстьТакаяНастройка = ПроверитьНастройкуПоПорталуНаДубль(ОбщиеНастройки.Сервер);
	//	
	//	Если УжеЕстьТакаяНастройка Тогда
	//		Портал	= "";
	//		Токен 	= "";
	//		ПоказатьОповещениеПользователя("Настройка с таким порталом уже существует. Создать еще одну нельзя.");
	//	Иначе
			Объект.Портал 	= ОбщиеНастройки.Сервер;
			Токен 	= Текст;		
	//	КонецЕсли; 
		
		ДанныеОЛицензиях = ОбменСБитрикс24ВызовСервера.ПолучитьЗначениеХранилищаНастроек("ДополнительнаяИнформация");
		Если ТипЗнч(ДанныеОЛицензиях) <> Тип("Соответствие") Тогда ДанныеОЛицензиях = Новый Соответствие КонецЕсли;
		
		ИнформацияОЛицензии = Новый Структура;
		ИнформацияОЛицензии.Вставить("Дата", ОбменСБитрикс24ВызовСервера.ПолучитьТекущуюДатуСеанса()-60*60*24); 
		ИнформацияОЛицензии.Вставить("Ключ", "");
		
		ДанныеОЛицензиях.Вставить(НастройкаПодключения, ИнформацияОЛицензии); 
		ОбменСБитрикс24ВызовСервера.УстановитьЗначениеВХранилищаНастроек("ДополнительнаяИнформация", ДанныеОЛицензиях);   
		
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТокенНаФормеПриИзменении(Элемент)
	
	ВыгружатьНастройкиНаПортал = Истина;
	
	//ОбщиеНастройки = ОбменСБитрикс24КлиентСервер.СформироватьБазовуюСтруктуруНастроек(Объект.Ссылка);
	//
	//Если ОбщиеНастройки = Неопределено Тогда
	//	ПоказатьПредупреждение(, "Не удалось подключиться к Битрикс24");
	//	Возврат;
	//КонецЕсли;
	//
	//Объект.Портал = ОбщиеНастройки.НастройкиПодключения.Сервер;
	
	//СохранитьНастройки();
	                                 
	//Метод = "/rest/app.option.set";	
	//ПараметрыЗапроса = "&options[realtime]=Y";
	//ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПортал(ОбщиеНастройки, Метод, ПараметрыЗапроса); 
	
	УстановитьДоступностьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопок()
	
	ДоступностьЭлементов = (ЗначениеЗаполнено(Объект.Портал) И ЗначениеЗаполнено(Токен));
	
	Элементы.ГруппаНастройкиЗагрузкиДанных.Доступность = ДоступностьЭлементов;
	Элементы.ГруппаЛогирование.Доступность = ДоступностьЭлементов;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройки()
	
	Попытка
		Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСинхронизацию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Токен) ИЛИ НЕ ЗначениеЗаполнено(Объект.Портал) Тогда	
		ПоказатьПредупреждение(, "Необходимо ввести ключ и адрес портала");
	ИначеЕсли Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОЗаписи", ЭтотОбъект), "Данные изменены или ещё не записаны, для продолжения, необходимо записать настройку, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьСинхронизациюПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаписи(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Попытка
			Записать();
			ВыполнитьСинхронизациюПродолжение();
		Исключение
			ПоказатьПредупреждение(, "Не удалось записать настройки: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизациюПродолжение()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаСинхронизации", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВидСинхронизации"		, 2);
	
	ОткрытьФорму("Справочник.НастройкиСинхронизацииСБитрикс24.Форма.ФормаВыполнениеСинхронизации", ПараметрыФормы,, Объект.Ссылка);
	
КонецПроцедуры	

&НаСервере
Процедура УстановкаБазовыхНастроекПоУмолчанию()
	
	Объект.ОбрезатьИсториюОбменов = Истина;
	Объект.ЧислоДнейХраненияИстории = 7;
	Объект.КоличествоДнейЗагрузки = 1;
	Объект.СпособСинхронизацииДанных = "Только ручной режим";
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьЛог(Команда)
	
	ОткрытьФорму("РегистрСведений.ЛогированиеОбменаСБитрикс24.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДетальнаяНастройкаСинхронизацииЛидов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаСинхронизации", Объект.Ссылка);
	
	ОП = новый ОписаниеОповещения("ПослеДетальнаяНастройкаСинхронизацииЛидов", ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиСинхронизацииСБитрикс24.Форма.ДетальнаяНастройкаСинхронизацииЛидов", ПараметрыФормы, ЭтаФорма, ,,, ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДетальнаяНастройкаСинхронизацииЛидов(ВозвращенноеЗначение, ДопПараметры) Экспорт
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПользователейСПортала(Команда)
	
	Если НЕ СохранитьНастройки() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОбновитьПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновитьПользователей()

	СтруктураНастроек = ОбменСБитрикс24ВызовСервера.СформироватьСтруктуруНастроек(Объект.Ссылка);  
	
	Если СтруктураНастроек = Неопределено Тогда
		ПоказатьПредупреждение(, "Не удалось подключиться к Битрикс24");
		Возврат;
	КонецЕсли;
		
	СтруктураНастроек.Логирование.Измерение2 = "Получение списка пользователей Б24";
	                                   
	Метод = "/rest/user.get.json";
	
	Фильтр = "&ACTIVE=Y";
		
	СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, Фильтр); 
	
	Если СтруктураОтвета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОтвета.Получить("result") <> неопределено Тогда
		
		Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
			
			//Если ТекЭлемент.Получить("ACTIVE") <> Истина Тогда
			//	Продолжить;
			//КонецЕсли;
			
			НайденныеСтроки = Объект.СопоставлениеПользователей.НайтиСтроки(Новый Структура("ИдПользователя", ТекЭлемент.Получить("ID")));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Объект.СопоставлениеПользователей.Добавить();
				НоваяСтрока.ФИО = Строка(ТекЭлемент.Получить("NAME")) + " " + Строка(ТекЭлемент.Получить("LAST_NAME"));
				НоваяСтрока.ИдПользователя =  Формат(ТекЭлемент.Получить("ID"), "ЧГ=0");
			Иначе
				Для каждого ТекСотрудник Из НайденныеСтроки Цикл
					ТекСотрудник.ФИО = Строка(ТекЭлемент.Получить("NAME")) + " " + Строка(ТекЭлемент.Получить("LAST_NAME"));
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Следующие = СтруктураОтвета.Получить("next"); 
	
	Пока ЗначениеЗаполнено(Следующие) Цикл
		
		Следующие = Формат(Следующие, "ЧГ=0");

		ТелоHTTPЗапроса = "&start="+Следующие + Фильтр;	
		
		СтруктураОтвета = ОбменСБитрикс24ВызовСервера.ОтправкаДанныхНаПортал(СтруктураНастроек, Метод, ТелоHTTPЗапроса); 
		
		Если СтруктураОтвета = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если СтруктураОтвета.Получить("result") <> Неопределено Тогда
			
			Для каждого ТекЭлемент Из СтруктураОтвета.Получить("result") Цикл
				
				Если ТекЭлемент.Получить("ACTIVE") <> Истина Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки = Объект.СопоставлениеПользователей.НайтиСтроки(Новый Структура("ИдПользователя", ТекЭлемент.Получить("ID")));
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = Объект.СопоставлениеПользователей.Добавить();
					НоваяСтрока.ФИО = Строка(ТекЭлемент.Получить("NAME")) + " " + Строка(ТекЭлемент.Получить("LAST_NAME"));
					НоваяСтрока.ИдПользователя = Формат(ТекЭлемент.Получить("ID"), "ЧГ=0");
				Иначе
					Для каждого ТекСотрудник Из НайденныеСтроки Цикл
						ТекСотрудник.ФИО = Строка(ТекЭлемент.Получить("NAME")) + " " + Строка(ТекЭлемент.Получить("LAST_NAME"));
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	   Следующие = СтруктураОтвета.Получить("next");
	   
	КонецЦикла;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСинхронизацииДанныхПриИзменении(Элемент)
	
	Если НЕ СохранитьНастройки() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить настройку");
		Возврат;
	КонецЕсли;
	
	ОбновитьОтображениеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Элементы.ГруппаНастройкаОбменаПоРасписанию.Видимость = (Объект.СпособСинхронизацииДанных = "ПоРасписанию");
	
	//++ №14571
	Элементы.ДетальнаяНастройкаСинхронизацииЛидов.Доступность = (Объект.СинхронизацияСделок);
	Элементы.ДетальнаяНастройкаСинхронизацииКонтрагентов.Доступность = (Объект.СинхронизацияКонтрагентов);
	//-- №14571
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)

	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписание", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписание(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	УстановитьНадписьРасписанияОбмена();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()
	
	Если РасписаниеРегламентногоЗадания = НеОпределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбмена.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		
		УстановитьПривилегированныйРежим(Истина); //Для возможности всем пользователям с правами устанавливать расписания		
		Если ТекущийОбъект.СпособСинхронизацииДанных = "ПоРасписанию" Тогда

			ИмяИспользуемогоРеглЗадания = "Синхронизация с Битрикс24: ";
			
			ПараметрыЗапуска = Новый Массив();
			ПараметрыЗапуска.Добавить(Объект.Ссылка);

			Задание = РегламентныеЗаданияСервер.Задание(ТекущийОбъект.ИдентификаторРегламентногоЗадания);
			Если Задание <> Неопределено Тогда

				ПараметрыИзмененияЗадания = Новый Структура();
				ПараметрыИзмененияЗадания.Вставить("Использование", Истина);
				ПараметрыИзмененияЗадания.Вставить("Параметры", ПараметрыЗапуска);
				ПараметрыИзмененияЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания);
				ПараметрыИзмененияЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 0);
				ПараметрыИзмененияЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 0);

				РегламентныеЗаданияСервер.ИзменитьЗадание(ТекущийОбъект.ИдентификаторРегламентногоЗадания, ПараметрыИзмененияЗадания);

			Иначе

				ПараметрыЗадания = Новый Структура();
				ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбменСБитрикс24);
				ПараметрыЗадания.Вставить("Наименование", ИмяИспользуемогоРеглЗадания
					+ ТекущийОбъект.Наименование);
				ПараметрыЗадания.Вставить("Ключ", ИмяИспользуемогоРеглЗадания
					+ ТекущийОбъект.Наименование);
				ПараметрыЗадания.Вставить("Использование", Истина);
				ПараметрыЗадания.Вставить("ЭксклюзивноеВыполнение", Ложь);
				ПараметрыЗадания.Вставить("Параметры", ПараметрыЗапуска);
				ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 0);
				ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 0);
				ПараметрыЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания);

				Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
				ТекущийОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
				
			КонецЕсли;

			Если Задание = Неопределено Тогда
				ИдентификаторРегламентногоЗадания = Неопределено;
			КонецЕсли;

		Иначе
			РегламентныеЗаданияСервер.УдалитьЗадание(ТекущийОбъект.ИдентификаторРегламентногоЗадания);
			ТекущийОбъект.ИдентификаторРегламентногоЗадания = Неопределено;
		КонецЕсли;		
	
		УстановитьПривилегированныйРежим(Ложь);	
		
		Модифицированность = Ложь;

	КонецЕсли;
	
КонецПроцедуры

//++ №14571
&НаКлиенте
Процедура СинхронизацияСделокПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияКонтрагентовПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДетальнаяНастройкаСинхронизацииКонтрагентов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаСинхронизации", Объект.Ссылка);
	
	ОП = новый ОписаниеОповещения("ПослеДетальнаяНастройкаСинхронизацииКонтрагентов", ЭтотОбъект);
	ОткрытьФорму("Справочник.НастройкиСинхронизацииСБитрикс24.Форма.ДетальнаяНастройкаСинхронизацииКонтрагентов", ПараметрыФормы, ЭтаФорма, ,,, ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДетальнаяНастройкаСинхронизацииКонтрагентов(ВозвращенноеЗначение, ДопПараметры) Экспорт
	
	Прочитать();
	
КонецПроцедуры

//-- №14571
